// automatically generated by rust-bindgen 0.69.4

#![allow(warnings)]

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;

pub const WPE_KEY_Switch_VT_3: u32 = 269024771;
pub const WPE_KEY_Switch_VT_4: u32 = 269024772;
pub const WPE_KEY_Switch_VT_5: u32 = 269024773;
pub const WPE_KEY_Switch_VT_6: u32 = 269024774;
pub const WPE_KEY_Switch_VT_7: u32 = 269024775;
pub const WPE_KEY_Switch_VT_8: u32 = 269024776;
pub const WPE_KEY_Switch_VT_9: u32 = 269024777;
pub const WPE_KEY_Switch_VT_10: u32 = 269024778;
pub const WPE_KEY_Switch_VT_11: u32 = 269024779;
pub const WPE_KEY_Switch_VT_12: u32 = 269024780;
pub const WPE_KEY_Ungrab: u32 = 269024800;
pub const WPE_KEY_WindowClearGrab: u32 = 269024801;
pub const WPE_KEY_Next_VMode: u32 = 269024802;
pub const WPE_KEY_Prev_VMode: u32 = 269024803;
pub const WPE_KEY_LogWindowTree: u32 = 269024804;
pub const WPE_KEY_LogGrabInfo: u32 = 269024805;
pub const WPE_MAJOR_VERSION: u32 = 1;
pub const WPE_MINOR_VERSION: u32 = 14;
pub const WPE_MICRO_VERSION: u32 = 2;
pub const WPE_BACKEND_MAJOR_VERSION: u32 = 1;
pub const WPE_BACKEND_MINOR_VERSION: u32 = 14;
pub const WPE_BACKEND_MICRO_VERSION: u32 = 2;
pub const KHRONOS_SUPPORT_INT64: u32 = 1;
pub const KHRONOS_SUPPORT_FLOAT: u32 = 1;
pub const KHRONOS_MAX_ENUM: u32 = 2147483647;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__fsid_t), "::", stringify!(__val))
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const wpe_gamepad_axis_WPE_GAMEPAD_AXIS_LEFT_STICK_X: wpe_gamepad_axis = 0;
pub const wpe_gamepad_axis_WPE_GAMEPAD_AXIS_LEFT_STICK_Y: wpe_gamepad_axis = 1;
pub const wpe_gamepad_axis_WPE_GAMEPAD_AXIS_RIGHT_STICK_X: wpe_gamepad_axis = 2;
pub const wpe_gamepad_axis_WPE_GAMEPAD_AXIS_RIGHT_STICK_Y: wpe_gamepad_axis = 3;
pub const wpe_gamepad_axis_WPE_GAMEPAD_AXIS_COUNT: wpe_gamepad_axis = 4;
/// wpe_gamepad_axis:
/// @WPE_GAMEPAD_AXIS_LEFT_STICK_X: Horizontal axis for left stick (negative
/// left/positive right). @WPE_GAMEPAD_AXIS_LEFT_STICK_Y: Vertical axis for left
/// stick (negative up/positive down). @WPE_GAMEPAD_AXIS_RIGHT_STICK_X:
/// Horizontal axis for right stick (negative left/positive right).
/// @WPE_GAMEPAD_AXIS_RIGHT_STICK_Y: Vertical axis for right stick (negative
/// up/positive down). @WPE_GAMEPAD_AXIS_COUNT: max number of axis.
///
/// Standard mapping.
/// Refer https://www.w3.org/TR/gamepad/#gamepadbutton-interface
pub type wpe_gamepad_axis = ::std::os::raw::c_uint;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_BOTTOM: wpe_gamepad_button = 0;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_RIGHT: wpe_gamepad_button = 1;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_LEFT: wpe_gamepad_button = 2;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_TOP: wpe_gamepad_button = 3;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_LEFT_SHOULDER: wpe_gamepad_button = 4;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_RIGHT_SHOULDER: wpe_gamepad_button = 5;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_LEFT_TRIGGER: wpe_gamepad_button = 6;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_RIGHT_TRIGGER: wpe_gamepad_button = 7;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_SELECT: wpe_gamepad_button = 8;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_START: wpe_gamepad_button = 9;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_LEFT_STICK: wpe_gamepad_button = 10;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_RIGHT_STICK: wpe_gamepad_button = 11;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_D_PAD_TOP: wpe_gamepad_button = 12;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_D_PAD_BOTTOM: wpe_gamepad_button = 13;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_D_PAD_LEFT: wpe_gamepad_button = 14;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_D_PAD_RIGHT: wpe_gamepad_button = 15;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_CENTER: wpe_gamepad_button = 16;
pub const wpe_gamepad_button_WPE_GAMEPAD_BUTTON_COUNT: wpe_gamepad_button = 17;
/// wpe_gamepad_button:
/// @WPE_GAMEPAD_BUTTON_BOTTOM: Bottom button in right cluster.
/// @WPE_GAMEPAD_BUTTON_RIGHT: Right button in right cluster.
/// @WPE_GAMEPAD_BUTTON_LEFT: Left button in right cluster.
/// @WPE_GAMEPAD_BUTTON_TOP: Top button in right cluster.
/// @WPE_GAMEPAD_BUTTON_LEFT_SHOULDER: Top left front button.
/// @WPE_GAMEPAD_BUTTON_RIGHT_SHOULDER: Top right front button.
/// @WPE_GAMEPAD_BUTTON_LEFT_TRIGGER: Bottom left front button.
/// @WPE_GAMEPAD_BUTTON_RIGHT_TRIGGER: Bottom right front button.
/// @WPE_GAMEPAD_BUTTON_SELECT: Left button in center cluster.
/// @WPE_GAMEPAD_BUTTON_START: Right button in center cluster.
/// @WPE_GAMEPAD_BUTTON_LEFT_STICK: Left stick pressed button.
/// @WPE_GAMEPAD_BUTTON_RIGHT_STICK: Right stick pressed button.
/// @WPE_GAMEPAD_BUTTON_D_PAD_TOP: Top button in left cluster.
/// @WPE_GAMEPAD_BUTTON_D_PAD_BOTOM: Bottom button in left cluster
/// @WPE_GAMEPAD_BUTTON_D_PAD_LEFT: Left button in left cluster.
/// @WPE_GAMEPAD_BUTTON_D_PAD_RIGHT: Right button in left cluster.
/// @WPE_GAMEPAD_BUTTON_CENTER: Center button in center cluster.
/// @WPE_GAMEPAD_BUTTON_COUNT: Max number of buttons.
///
/// Standard mapping.
/// Refer https://www.w3.org/TR/gamepad/#gamepadbutton-interface
pub type wpe_gamepad_button = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_gamepad {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_gamepad_provider {
    _unused: [u8; 0],
}
/// wpe_gamepad_provider_client_interface:
/// @connected: Callback to inform WPEWebKit that a new gamepad device is
/// plugged. @disconnected: Callback to inform WPEWebKit that a new gamepad
/// device is gone.
///
/// This interface is defines gamepad provider callbacks to notify WPEWebKit of
/// devices.
///
/// Since: 1.14
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_gamepad_provider_client_interface {
    pub connected:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize)>,
    pub disconnected:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize)>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_gamepad_provider_client_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_gamepad_provider_client_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_gamepad_provider_client_interface>(),
        40usize,
        concat!("Size of: ", stringify!(wpe_gamepad_provider_client_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_gamepad_provider_client_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_gamepad_provider_client_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connected) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_client_interface),
            "::",
            stringify!(connected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disconnected) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_client_interface),
            "::",
            stringify!(disconnected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_client_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_client_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_client_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
/// wpe_gamepad_client_interface:
/// @button_changed: Callback to inform WPEWebkit a change in the status of a
/// button. @axis_changed: Callback to inform WPEWebkit a change in the status
/// of an axis.
///
/// This interface is defines gamepad callbacks to notify WPEWebKit of events.
///
/// Since: 1.14
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_gamepad_client_interface {
    pub button_changed: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: wpe_gamepad_button,
            arg3: bool,
        ),
    >,
    pub axis_changed: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: wpe_gamepad_axis, arg3: f64),
    >,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_gamepad_client_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_gamepad_client_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_gamepad_client_interface>(),
        40usize,
        concat!("Size of: ", stringify!(wpe_gamepad_client_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_gamepad_client_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_gamepad_client_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).button_changed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_client_interface),
            "::",
            stringify!(button_changed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis_changed) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_client_interface),
            "::",
            stringify!(axis_changed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_client_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_client_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_client_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
/// wpe_gamepad_provider_interface:
/// @create: create an internal representation of a gamepad provider.
/// @destroy: destroy instance gamepad provider.
/// @start: gamepad device should start monitoring for gamepad devices.
/// @stop: gamepad device should stop monitoring for gamepad devices.
/// @get_view_backend: request the view backend where gamepad device is
/// attached.
///
/// Methods called by WebKit requesting gamepad provider operations to
/// implementator.
///
/// Since: 1.14
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_gamepad_provider_interface {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut wpe_gamepad_provider) -> *mut ::std::os::raw::c_void,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub start: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub stop: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub get_view_backend: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_void,
        ) -> *mut wpe_view_backend,
    >,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_gamepad_provider_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_gamepad_provider_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_gamepad_provider_interface>(),
        64usize,
        concat!("Size of: ", stringify!(wpe_gamepad_provider_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_gamepad_provider_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_gamepad_provider_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stop) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_view_backend) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(get_view_backend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_provider_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
/// wpe_gamepad_provider_interface:
/// @create: creates a gamepad device.
/// @destroy: destroy a gamepad device.
/// @get_id: Gets the gamepad's id string.
///
/// Methods called by WebKit requesting gamepad device operations to
/// implementator.
///
/// Since: 1.14
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_gamepad_interface {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut wpe_gamepad,
            arg2: *mut wpe_gamepad_provider,
            arg3: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub get_id: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char,
    >,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_gamepad_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_gamepad_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_gamepad_interface>(),
        48usize,
        concat!("Size of: ", stringify!(wpe_gamepad_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_gamepad_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_gamepad_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(wpe_gamepad_interface), "::", stringify!(create))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(wpe_gamepad_interface), "::", stringify!(destroy))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_id) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(wpe_gamepad_interface), "::", stringify!(get_id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_gamepad_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
unsafe extern "C" {
    /// wpe_gamepad_provider_create:
    ///
    /// This method is called by WPEWebKit.
    ///
    /// Returns: an opaque object representing the gamepad provider in libwpe.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_create() -> *mut wpe_gamepad_provider;
}
unsafe extern "C" {
    /// wpe_gamepad_provider_destroy:
    /// @provider: opaque libwpe's representation of gamepad provider.
    ///
    /// Frees the internal resources used by @provider.
    ///
    /// This method is called by WPEWebKit.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_destroy(arg1: *mut wpe_gamepad_provider);
}
unsafe extern "C" {
    /// wpe_gamepad_provider_set_client:
    /// @provider: opaque libwpe's representation of gamepad provider.
    /// @client_interface: WPEWebKit callbacks for gamepad devices appearance.
    /// @client_data: WPEWebkit closure data.
    ///
    /// Sets WPEWebKit callbacks in @provider.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_set_client(
        arg1: *mut wpe_gamepad_provider,
        arg2: *const wpe_gamepad_provider_client_interface,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    /// wpe_gamepad_provider_start:
    /// @provider: opaque libwpe's representation of gamepad provider.
    ///
    /// Called by WPEWebkit to start @provider monitoring for gamepad
    /// devices.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_start(arg1: *mut wpe_gamepad_provider);
}
unsafe extern "C" {
    /// wpe_gamepad_provider_stop:
    /// @provider: opaque libwpe's representation of gamepad provider.
    ///
    /// Called by WPEWebkit to stop @provider monitoring for gamepad
    /// devices.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_stop(arg1: *mut wpe_gamepad_provider);
}
unsafe extern "C" {
    /// wpe_gamepad_provider_get_backend:
    /// @provider: opaque libwpe's representation of gamepad provider.
    ///
    /// Called by application (gamepad implementator) to access it's internal
    /// object.
    ///
    /// Returns: the pointer to the implementator's object.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_get_backend(
        arg1: *mut wpe_gamepad_provider,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    /// wpe_gampepad_provider_get_view_backend:
    /// @provider: opaque libwpe's representation of gamepad provider.
    /// @gamepad: opaque libwep's representation of gampead
    ///
    /// Ask @provider for the view to where @gamepad is attached.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_get_view_backend(
        arg1: *mut wpe_gamepad_provider,
        arg2: *mut wpe_gamepad,
    ) -> *mut wpe_view_backend;
}
unsafe extern "C" {
    /// wpe_gamepad_provider_dispatch_gamepad_connected:
    /// @provider: opaque libwpe's representation of gamepad provider.
    /// @gamepad_id: application's gamepad device identifier.
    ///
    /// Method called by application (gamepad implementator) to inform
    /// WPEWebKit that a new gamepad device is plugged.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_dispatch_gamepad_connected(
        arg1: *mut wpe_gamepad_provider,
        arg2: usize,
    );
}
unsafe extern "C" {
    /// wpe_gamepad_provider_dispatch_gamepad_disconnected:
    /// @provider: opaque libwpe's representation of gamepad provider.
    /// @gamepad_id: application's gamepad device identifier.
    ///
    /// Method called by application (gamepad implementator) to inform
    /// WPEWebKit that a plugged gamepad device has been unplugged.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_provider_dispatch_gamepad_disconnected(
        arg1: *mut wpe_gamepad_provider,
        arg2: usize,
    );
}
unsafe extern "C" {
    /// wpe_gamepad_create:
    /// @provider:  provider of the gamepad to create.
    /// @gamepad_id: opaque application's representation of gamepad provider.
    ///
    /// Method called by WPEWebKit to create an internal representation of a
    /// gamepad device.
    ///
    /// Returns: opaque libwpe's representation of a gamepad device.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_create(arg1: *mut wpe_gamepad_provider, arg2: usize) -> *mut wpe_gamepad;
}
unsafe extern "C" {
    /// wpe_gamepad_destroy:
    /// @gamepad: opaque libwpe's representation of gamepad.
    ///
    /// Called by WPEWebkit to free the internal resources used by @gamepad
    /// object.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_destroy(arg1: *mut wpe_gamepad);
}
unsafe extern "C" {
    /// wpe_gamepad_provider_set_client:
    /// @gamepad: opaque libwpe's representation of gamepad.
    /// @client_interface: WPEWebKit callbacks for gamepad devices events.
    /// @client_data: WPEWebkit closure data.
    ///
    /// Sets WPEWebKit's callbacks for events in @gamepad.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_set_client(
        arg1: *mut wpe_gamepad,
        arg2: *const wpe_gamepad_client_interface,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    /// wpe_gamepad_get_id:
    /// @gamepad: opaque libwpe's representation of gamepad.
    ///
    /// Gets the identification string for the @gamepad.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_get_id(arg1: *mut wpe_gamepad) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    /// wpe_gamepad_dispatch_button_changed:
    /// @gamepad: opaque gamepad object.
    /// @button: the standard button that changed its state.
    /// @pressed: the new state: %TRUE pressed, otherwise released.
    ///
    /// Method called by application (gamepad implementator). It reports to
    /// WPEWebkit a change in the status of @button.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_dispatch_button_changed(
        arg1: *mut wpe_gamepad,
        arg2: wpe_gamepad_button,
        arg3: bool,
    );
}
unsafe extern "C" {
    /// wpe_gamepad_dispatch_axis_changed:
    /// @gamepad: opaque gamepad object.
    /// @axis: the standard axis that changed its state.
    /// @value: the value of @axis
    ///
    /// Method called by application (gamepad implementator). It reports to
    /// WPEWebkit a change in the position of @axis.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_dispatch_axis_changed(
        arg1: *mut wpe_gamepad,
        arg2: wpe_gamepad_axis,
        arg3: f64,
    );
}
unsafe extern "C" {
    /// wpe_gamepad_set_handler:
    /// @provider_iface: (transfer none): Application callbacks for gamepad
    /// provider. @gamepad_iface: (transfer none): Applications callbacks
    /// for gamepad device.
    ///
    /// Method called by the application (gamepad implementator) to
    /// register, in libwpe, the callbacks for gamepad devices and gamepad
    /// provider.
    ///
    /// Note that the last registered handlers will be used.
    ///
    /// Since: 1.14
    pub fn wpe_gamepad_set_handler(
        arg1: *const wpe_gamepad_provider_interface,
        arg2: *const wpe_gamepad_interface,
    );
}
pub const wpe_input_modifier_wpe_input_keyboard_modifier_control: wpe_input_modifier = 1;
pub const wpe_input_modifier_wpe_input_keyboard_modifier_shift: wpe_input_modifier = 2;
pub const wpe_input_modifier_wpe_input_keyboard_modifier_alt: wpe_input_modifier = 4;
pub const wpe_input_modifier_wpe_input_keyboard_modifier_meta: wpe_input_modifier = 8;
pub const wpe_input_modifier_wpe_input_pointer_modifier_button1: wpe_input_modifier = 1048576;
pub const wpe_input_modifier_wpe_input_pointer_modifier_button2: wpe_input_modifier = 2097152;
pub const wpe_input_modifier_wpe_input_pointer_modifier_button3: wpe_input_modifier = 4194304;
pub const wpe_input_modifier_wpe_input_pointer_modifier_button4: wpe_input_modifier = 8388608;
pub const wpe_input_modifier_wpe_input_pointer_modifier_button5: wpe_input_modifier = 16777216;
pub type wpe_input_modifier = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_input_keyboard_event {
    pub time: u32,
    pub key_code: u32,
    pub hardware_key_code: u32,
    pub pressed: bool,
    pub modifiers: u32,
}
#[test]
fn bindgen_test_layout_wpe_input_keyboard_event() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_input_keyboard_event> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_input_keyboard_event>(),
        20usize,
        concat!("Size of: ", stringify!(wpe_input_keyboard_event))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_input_keyboard_event>(),
        4usize,
        concat!("Alignment of ", stringify!(wpe_input_keyboard_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(wpe_input_keyboard_event), "::", stringify!(time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_code) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_keyboard_event),
            "::",
            stringify!(key_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hardware_key_code) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_keyboard_event),
            "::",
            stringify!(hardware_key_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pressed) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_keyboard_event),
            "::",
            stringify!(pressed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_keyboard_event),
            "::",
            stringify!(modifiers)
        )
    );
}
pub const wpe_input_pointer_event_type_wpe_input_pointer_event_type_null:
    wpe_input_pointer_event_type = 0;
pub const wpe_input_pointer_event_type_wpe_input_pointer_event_type_motion:
    wpe_input_pointer_event_type = 1;
pub const wpe_input_pointer_event_type_wpe_input_pointer_event_type_button:
    wpe_input_pointer_event_type = 2;
pub type wpe_input_pointer_event_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_input_pointer_event {
    pub type_: wpe_input_pointer_event_type,
    pub time: u32,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub button: u32,
    pub state: u32,
    pub modifiers: u32,
}
#[test]
fn bindgen_test_layout_wpe_input_pointer_event() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_input_pointer_event> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_input_pointer_event>(),
        28usize,
        concat!("Size of: ", stringify!(wpe_input_pointer_event))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_input_pointer_event>(),
        4usize,
        concat!("Alignment of ", stringify!(wpe_input_pointer_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(wpe_input_pointer_event), "::", stringify!(type_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(wpe_input_pointer_event), "::", stringify!(time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(wpe_input_pointer_event), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(wpe_input_pointer_event), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).button) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(wpe_input_pointer_event), "::", stringify!(button))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(wpe_input_pointer_event), "::", stringify!(state))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_pointer_event),
            "::",
            stringify!(modifiers)
        )
    );
}
pub const wpe_input_axis_event_type_wpe_input_axis_event_type_null: wpe_input_axis_event_type = 0;
pub const wpe_input_axis_event_type_wpe_input_axis_event_type_motion: wpe_input_axis_event_type = 1;
pub const wpe_input_axis_event_type_wpe_input_axis_event_type_motion_smooth:
    wpe_input_axis_event_type = 2;
pub const wpe_input_axis_event_type_wpe_input_axis_event_type_mask_2d: wpe_input_axis_event_type =
    65536;
pub type wpe_input_axis_event_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_input_axis_event {
    pub type_: wpe_input_axis_event_type,
    pub time: u32,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub axis: u32,
    pub value: i32,
    pub modifiers: u32,
}
#[test]
fn bindgen_test_layout_wpe_input_axis_event() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_input_axis_event> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_input_axis_event>(),
        28usize,
        concat!("Size of: ", stringify!(wpe_input_axis_event))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_input_axis_event>(),
        4usize,
        concat!("Alignment of ", stringify!(wpe_input_axis_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(type_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(axis))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_event), "::", stringify!(modifiers))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_input_axis_2d_event {
    pub base: wpe_input_axis_event,
    pub x_axis: f64,
    pub y_axis: f64,
}
#[test]
fn bindgen_test_layout_wpe_input_axis_2d_event() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_input_axis_2d_event> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_input_axis_2d_event>(),
        48usize,
        concat!("Size of: ", stringify!(wpe_input_axis_2d_event))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_input_axis_2d_event>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_input_axis_2d_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_2d_event), "::", stringify!(base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_axis) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_2d_event), "::", stringify!(x_axis))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y_axis) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(wpe_input_axis_2d_event), "::", stringify!(y_axis))
    );
}
pub const wpe_input_touch_event_type_wpe_input_touch_event_type_null: wpe_input_touch_event_type =
    0;
pub const wpe_input_touch_event_type_wpe_input_touch_event_type_down: wpe_input_touch_event_type =
    1;
pub const wpe_input_touch_event_type_wpe_input_touch_event_type_motion: wpe_input_touch_event_type =
    2;
pub const wpe_input_touch_event_type_wpe_input_touch_event_type_up: wpe_input_touch_event_type = 3;
pub type wpe_input_touch_event_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_input_touch_event_raw {
    pub type_: wpe_input_touch_event_type,
    pub time: u32,
    pub id: ::std::os::raw::c_int,
    pub x: i32,
    pub y: i32,
}
#[test]
fn bindgen_test_layout_wpe_input_touch_event_raw() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_input_touch_event_raw> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_input_touch_event_raw>(),
        20usize,
        concat!("Size of: ", stringify!(wpe_input_touch_event_raw))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_input_touch_event_raw>(),
        4usize,
        concat!("Alignment of ", stringify!(wpe_input_touch_event_raw))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_touch_event_raw),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event_raw), "::", stringify!(time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event_raw), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event_raw), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event_raw), "::", stringify!(y))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_input_touch_event {
    pub touchpoints: *const wpe_input_touch_event_raw,
    pub touchpoints_length: u64,
    pub type_: wpe_input_touch_event_type,
    pub id: i32,
    pub time: u32,
    pub modifiers: u32,
}
#[test]
fn bindgen_test_layout_wpe_input_touch_event() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_input_touch_event> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_input_touch_event>(),
        32usize,
        concat!("Size of: ", stringify!(wpe_input_touch_event))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_input_touch_event>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_input_touch_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).touchpoints) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_touch_event),
            "::",
            stringify!(touchpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).touchpoints_length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_touch_event),
            "::",
            stringify!(touchpoints_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event), "::", stringify!(type_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(wpe_input_touch_event), "::", stringify!(time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_input_touch_event),
            "::",
            stringify!(modifiers)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_key_code_to_unicode(arg1: u32) -> u32;
}
unsafe extern "C" {
    pub fn wpe_unicode_to_key_code(arg1: u32) -> u32;
}
/// wpe_loader_interface:
/// @load_object: Callback invoked by `libwpe` to instantiate objects.
///
/// An implementation of a WPE backend *must* define a `_wpe_loader_interface`
/// symbol of this type.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_loader_interface {
    pub load_object: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_loader_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_loader_interface> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_loader_interface>(),
        40usize,
        concat!("Size of: ", stringify!(wpe_loader_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_loader_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_loader_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).load_object) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_loader_interface),
            "::",
            stringify!(load_object)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_loader_interface),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_loader_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_loader_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_loader_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
unsafe extern "C" {
    /// wpe_loader_init:
    /// @impl_library_name: (transfer none): Name of the shared library object
    ///     to load as WPE backend implementation.
    ///
    /// Initializes the `libwpe` object loader
    ///
    /// Returns: Whether initialization succeeded.
    pub fn wpe_loader_init(impl_library_name: *const ::std::os::raw::c_char) -> bool;
}
unsafe extern "C" {
    /// wpe_loader_get_loaded_implementation_library_name:
    ///
    /// Obtain the name of the shared library object loaded as WPE backend
    /// implementation. Note that in general this will return the value passed
    /// to wpe_loader_init(), but that is not guaranteed.
    ///
    /// Returns: (transfer none): Name of the shared library object for the
    ///     backend implementation.
    pub fn wpe_loader_get_loaded_implementation_library_name() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_pasteboard_string {
    pub data: *mut ::std::os::raw::c_char,
    pub length: u64,
}
#[test]
fn bindgen_test_layout_wpe_pasteboard_string() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_pasteboard_string> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_pasteboard_string>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_pasteboard_string))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_pasteboard_string>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_pasteboard_string))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(wpe_pasteboard_string), "::", stringify!(data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(wpe_pasteboard_string), "::", stringify!(length))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_pasteboard_string_vector {
    pub strings: *mut wpe_pasteboard_string,
    pub length: u64,
}
#[test]
fn bindgen_test_layout_wpe_pasteboard_string_vector() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_pasteboard_string_vector> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_pasteboard_string_vector>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_pasteboard_string_vector))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_pasteboard_string_vector>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_pasteboard_string_vector))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).strings) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_string_vector),
            "::",
            stringify!(strings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_string_vector),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_pasteboard_string_pair {
    pub type_: wpe_pasteboard_string,
    pub string: wpe_pasteboard_string,
}
#[test]
fn bindgen_test_layout_wpe_pasteboard_string_pair() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_pasteboard_string_pair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_pasteboard_string_pair>(),
        32usize,
        concat!("Size of: ", stringify!(wpe_pasteboard_string_pair))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_pasteboard_string_pair>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_pasteboard_string_pair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_string_pair),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_string_pair),
            "::",
            stringify!(string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_pasteboard_string_map {
    pub pairs: *mut wpe_pasteboard_string_pair,
    pub length: u64,
}
#[test]
fn bindgen_test_layout_wpe_pasteboard_string_map() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_pasteboard_string_map> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_pasteboard_string_map>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_pasteboard_string_map))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_pasteboard_string_map>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_pasteboard_string_map))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pairs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_string_map),
            "::",
            stringify!(pairs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_string_map),
            "::",
            stringify!(length)
        )
    );
}
unsafe extern "C" {
    /// wpe_pasteboard_string_initialize:
    /// @pbstring: (transfer none): A pasteboard string.
    /// @contents: (transfer none): Contents to copy into the pasteboard string.
    /// @length: Length of the contents, in bytes.
    ///
    /// Initializes a pasteboard string.
    ///
    /// When the string is not needed anymore, use wpe_pasteboard_string_free()
    /// to free resources.
    pub fn wpe_pasteboard_string_initialize(
        pbstring: *mut wpe_pasteboard_string,
        contents: *const ::std::os::raw::c_char,
        length: u64,
    );
}
unsafe extern "C" {
    /// wpe_pasteboard_string_free:
    /// @pbstring: (transfer none): A pasteboard string.
    ///
    /// Frees any resources associated with @pbstring which may have been
    /// previously allocated by wpe_pasteboard_string_initialize().
    pub fn wpe_pasteboard_string_free(pbstring: *mut wpe_pasteboard_string);
}
unsafe extern "C" {
    pub fn wpe_pasteboard_string_vector_free(arg1: *mut wpe_pasteboard_string_vector);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_pasteboard {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_pasteboard_interface {
    pub initialize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut wpe_pasteboard) -> *mut ::std::os::raw::c_void,
    >,
    pub get_types: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut wpe_pasteboard_string_vector,
        ),
    >,
    pub get_string: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: *mut wpe_pasteboard_string,
        ),
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut wpe_pasteboard_string_map,
        ),
    >,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_pasteboard_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_pasteboard_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_pasteboard_interface>(),
        64usize,
        concat!("Size of: ", stringify!(wpe_pasteboard_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_pasteboard_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_pasteboard_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_types) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(get_types)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_string) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(get_string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(wpe_pasteboard_interface), "::", stringify!(write))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_pasteboard_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
unsafe extern "C" {
    /// wpe_pasteboard_get_singleton:
    ///
    /// Obtains the pasteboard object, creating it if neccessary.
    ///
    /// Returns: The pasteboard object.
    pub fn wpe_pasteboard_get_singleton() -> *mut wpe_pasteboard;
}
unsafe extern "C" {
    pub fn wpe_pasteboard_get_types(
        arg1: *mut wpe_pasteboard,
        arg2: *mut wpe_pasteboard_string_vector,
    );
}
unsafe extern "C" {
    pub fn wpe_pasteboard_get_string(
        arg1: *mut wpe_pasteboard,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut wpe_pasteboard_string,
    );
}
unsafe extern "C" {
    pub fn wpe_pasteboard_write(arg1: *mut wpe_pasteboard, arg2: *mut wpe_pasteboard_string_map);
}
pub const wpe_process_type_WPE_PROCESS_TYPE_WEB: wpe_process_type = 0;
pub const wpe_process_type_WPE_PROCESS_TYPE_NETWORK: wpe_process_type = 1;
pub const wpe_process_type_WPE_PROCESS_TYPE_GPU: wpe_process_type = 2;
pub const wpe_process_type_WPE_PROCESS_TYPE_WEB_AUTHN: wpe_process_type = 3;
/// wpe_process_type:
/// @WPE_PROCESS_TYPE_WEB: WebKit's WebProcess.
/// @WPE_PROCESS_TYPE_NETWORK: WebKit's NetworkProcess.
/// @WPE_PROCESS_TYPE_GPU: WebKit's GPUProcess.
/// @WPE_PROCESS_TYPE_WEB_AUTHN: WebKit's WebAuthNProcess.
///
/// Maps to the processes launched by WebKit.
pub type wpe_process_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_process_provider {
    _unused: [u8; 0],
}
/// wpe_process_provider_interface:
/// @create: create an internal representation of a process provider.
/// @destroy: destroy instance process provider.
/// @launch: launches the specified WebKit process.
/// @terminate: terminates the specified Webkit process.
///
/// Methods called by WebKit requesting process provider operations to
/// implementator.
///
/// Since: 1.14
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_process_provider_interface {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut wpe_process_provider) -> *mut ::std::os::raw::c_void,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub launch: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: wpe_process_type,
            arg3: *mut ::std::os::raw::c_void,
        ) -> i64,
    >,
    pub terminate:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: i64)>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved4: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved5: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_process_provider_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_process_provider_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_process_provider_interface>(),
        72usize,
        concat!("Size of: ", stringify!(wpe_process_provider_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_process_provider_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_process_provider_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).launch) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(launch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).terminate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(terminate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved4) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(_wpe_reserved4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved5) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_process_provider_interface),
            "::",
            stringify!(_wpe_reserved5)
        )
    );
}
unsafe extern "C" {
    /// wpe_process_provider_create:
    ///
    /// This method is called by WPEWebKit.
    ///
    /// Returns: an opaque object representing the process provider in libwpe.
    ///
    /// Since: 1.14
    pub fn wpe_process_provider_create() -> *mut wpe_process_provider;
}
unsafe extern "C" {
    /// wpe_process_provider_destroy:
    /// @provider: opaque libwpe's representation of the process provider.
    ///
    /// Frees the internal resources used by @provider.
    ///
    /// This method is called by WPEWebKit.
    ///
    /// Since: 1.14
    pub fn wpe_process_provider_destroy(arg1: *mut wpe_process_provider);
}
unsafe extern "C" {
    /// wpe_process_launch:
    /// @provider: opaque libwpe's representation of the process provider.
    /// @type: the process type to launch.
    /// @userdata: user data passed needed to launch the process.
    ///
    /// Launches the specified WebKit process.
    ///
    /// Returns: an identifier for the process.
    ///
    /// Since: 1.14
    pub fn wpe_process_launch(
        arg1: *mut wpe_process_provider,
        arg2: wpe_process_type,
        arg3: *mut ::std::os::raw::c_void,
    ) -> i64;
}
unsafe extern "C" {
    /// wpe_process_terminate:
    /// @provider: opaque libwpe's representation of the process provider.
    /// @process: identifier for the process to terminate.
    ///
    /// Terminates the specified WebKit process.
    ///
    /// Since: 1.14
    pub fn wpe_process_terminate(arg1: *mut wpe_process_provider, arg2: i64);
}
unsafe extern "C" {
    /// wpe_process_provider_register_interface:
    /// @iface: interface for the process provider.
    ///
    /// Sets the process provider interface.
    ///
    /// This method is called by WPEWebKit.
    ///
    /// Since: 1.14
    pub fn wpe_process_provider_register_interface(arg1: *const wpe_process_provider_interface);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_host_interface {
    pub create: ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub create_client: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_renderer_host_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_host_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_host_interface>(),
        56usize,
        concat!("Size of: ", stringify!(wpe_renderer_host_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_host_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_host_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_client) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(create_client)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_host_base {
    pub interface: *const wpe_renderer_host_interface,
    pub interface_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wpe_renderer_host_base() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_host_base> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_host_base>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_renderer_host_base))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_host_base>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_host_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_base),
            "::",
            stringify!(interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_host_base),
            "::",
            stringify!(interface_data)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_host_create_client() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    /// wpe_backend_get_major_version:
    ///
    /// Returns: Major version of the `libwpe` library.
    ///
    /// Deprecated: Since `libwpe` version 1.0.0, use wpe_get_major_version()
    ///     instead.
    pub fn wpe_backend_get_major_version() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    /// wpe_backend_get_minor_version:
    ///
    /// Returns: Minor version of the `libwpe` library.
    ///
    /// Deprecated: Since `libwpe` version 1.0.0, use wpe_get_minor_version()
    ///     instead.
    pub fn wpe_backend_get_minor_version() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    /// wpe_backend_get_micro_version:
    ///
    /// Returns: Micro version of the `libwpe` library.
    ///
    /// Deprecated: Since `libwpe` version 1.0.0, use wpe_get_micro_version()
    ///     instead.
    pub fn wpe_backend_get_micro_version() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    /// wpe_get_major_version:
    ///
    /// Returns: Major version of the `libwpe` library.
    pub fn wpe_get_major_version() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    /// wpe_get_minor_version:
    ///
    /// Returns: Minor version of the `libwpe` library.
    pub fn wpe_get_minor_version() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    /// wpe_get_micro_version:
    ///
    /// Returns: Micro version of the `libwpe` library.
    pub fn wpe_get_micro_version() -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_view_backend {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_view_backend_interface {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut wpe_view_backend,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub initialize: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub get_renderer_host_fd: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_view_backend_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_view_backend_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_view_backend_interface>(),
        64usize,
        concat!("Size of: ", stringify!(wpe_view_backend_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_view_backend_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_view_backend_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_renderer_host_fd) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(get_renderer_host_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_view_backend_base {
    pub interface: *const wpe_view_backend_interface,
    pub interface_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wpe_view_backend_base() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_view_backend_base> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_view_backend_base>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_view_backend_base))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_view_backend_base>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_view_backend_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_base),
            "::",
            stringify!(interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_base),
            "::",
            stringify!(interface_data)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_create() -> *mut wpe_view_backend;
}
unsafe extern "C" {
    pub fn wpe_view_backend_create_with_backend_interface(
        arg1: *mut wpe_view_backend_interface,
        arg2: *mut ::std::os::raw::c_void,
    ) -> *mut wpe_view_backend;
}
unsafe extern "C" {
    pub fn wpe_view_backend_destroy(arg1: *mut wpe_view_backend);
}
unsafe extern "C" {
    pub fn wpe_view_backend_set_backend_client(
        arg1: *mut wpe_view_backend,
        arg2: *const wpe_view_backend_client,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_set_input_client(
        arg1: *mut wpe_view_backend,
        arg2: *const wpe_view_backend_input_client,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    /// wpe_view_backend_set_fullscreen_client:
    /// @view_backend: (transfer none): The view backend to obtains events from.
    /// @client: (transfer none) (nullable): Client with callbacks for the
    /// events. @userdata: (transfer none) (nullable): User data passed to
    /// client callbacks.
    ///
    /// Configure a @client with callbacks invoked for DOM fullscreen requests.
    ///
    /// This function must be only used once for a given @view_backend, the
    /// client cannot be changed once it has been set.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_set_fullscreen_client(
        arg1: *mut wpe_view_backend,
        arg2: *const wpe_view_backend_fullscreen_client,
        arg3: *mut ::std::os::raw::c_void,
    );
}
/// wpe_view_backend_fullscreen_handler:
/// @userdata: (transfer none): User data passed to the embedder.
/// @enable: (transfer none): User data passed to the embedder.
///
/// Type of functions used by an embedder to implement fullscreening web views.
///
/// Returns: a boolean indicating whether the operation was completed.
///
/// Since: 1.12
pub type wpe_view_backend_fullscreen_handler = ::std::option::Option<
    unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void, enable: bool) -> bool,
>;
unsafe extern "C" {
    /// wpe_view_backend_set_fullscreen_handler:
    /// @view_backend: (transfer none): The view backend to obtains events from.
    /// @handler: (transfer none): Function used by an embedder to implement
    /// fullscreening web views. @userdata: (transfer none): User data
    /// passed to the handler function.
    ///
    /// Handler function set by an embedder to implement fullscreening web
    /// views.
    ///
    /// This function must be only used once for a given @view_backend, the
    /// handler cannot be changed once it has been set.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_set_fullscreen_handler(
        arg1: *mut wpe_view_backend,
        handler: wpe_view_backend_fullscreen_handler,
        userdata: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_initialize(arg1: *mut wpe_view_backend);
}
unsafe extern "C" {
    pub fn wpe_view_backend_get_renderer_host_fd(
        arg1: *mut wpe_view_backend,
    ) -> ::std::os::raw::c_int;
}
pub const wpe_view_activity_state_wpe_view_activity_state_visible: wpe_view_activity_state = 1;
pub const wpe_view_activity_state_wpe_view_activity_state_focused: wpe_view_activity_state = 2;
pub const wpe_view_activity_state_wpe_view_activity_state_in_window: wpe_view_activity_state = 4;
pub type wpe_view_activity_state = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_view_backend_client {
    pub set_size: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u32, arg3: u32),
    >,
    pub frame_displayed:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub activity_state_changed:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u32)>,
    pub get_accessible: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
    >,
    pub set_device_scale_factor:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: f32)>,
    pub target_refresh_rate_changed:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u32)>,
}
#[test]
fn bindgen_test_layout_wpe_view_backend_client() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_view_backend_client> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_view_backend_client>(),
        48usize,
        concat!("Size of: ", stringify!(wpe_view_backend_client))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_view_backend_client>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_view_backend_client))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_client),
            "::",
            stringify!(set_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_displayed) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_client),
            "::",
            stringify!(frame_displayed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).activity_state_changed) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_client),
            "::",
            stringify!(activity_state_changed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_accessible) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_client),
            "::",
            stringify!(get_accessible)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set_device_scale_factor) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_client),
            "::",
            stringify!(set_device_scale_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_refresh_rate_changed) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_client),
            "::",
            stringify!(target_refresh_rate_changed)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_set_size(arg1: *mut wpe_view_backend, arg2: u32, arg3: u32);
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_frame_displayed(arg1: *mut wpe_view_backend);
}
unsafe extern "C" {
    pub fn wpe_view_backend_add_activity_state(arg1: *mut wpe_view_backend, arg2: u32);
}
unsafe extern "C" {
    pub fn wpe_view_backend_remove_activity_state(arg1: *mut wpe_view_backend, arg2: u32);
}
unsafe extern "C" {
    pub fn wpe_view_backend_get_activity_state(arg1: *mut wpe_view_backend) -> u32;
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_get_accessible(
        backend: *mut wpe_view_backend,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    /// wpe_view_backend_dispatch_set_device_scale_factor:
    /// @view_backend: (transfer none): The view backend to configure.
    /// @factor: Scaling factor to apply.
    ///
    /// Configure the device scaling factor applied to rendered content.
    ///
    /// Set the @factor by which sizes of content rendered to a web view will be
    /// multiplied by. The typical reason to set a value other than `1.0` (the
    /// default) is to produce output that will display at the intended physical
    /// size in displays with a high density of pixels.
    ///
    /// Only values from `0.05` up to `5.0` are allowed. Setting a value outside
    /// this range will be ignored, and in debug builds execution will be
    /// aborted.
    ///
    /// For example, a display that has a physical resolution of 3840x2160 with
    /// a scaling factor of `2.0` will make web content behave as if the screen
    /// had a size of 1920x1080, and content will be rendered at twice the size:
    /// each logical pixel will occupy four physical pixels (a 2x2 box) on
    /// the output.
    ///
    /// Since: 1.4
    pub fn wpe_view_backend_dispatch_set_device_scale_factor(
        arg1: *mut wpe_view_backend,
        arg2: f32,
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_get_target_refresh_rate(arg1: *mut wpe_view_backend) -> u32;
}
unsafe extern "C" {
    pub fn wpe_view_backend_set_target_refresh_rate(arg1: *mut wpe_view_backend, arg2: u32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_view_backend_input_client {
    pub handle_keyboard_event: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut wpe_input_keyboard_event,
        ),
    >,
    pub handle_pointer_event: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut wpe_input_pointer_event),
    >,
    pub handle_axis_event: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut wpe_input_axis_event),
    >,
    pub handle_touch_event: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut wpe_input_touch_event),
    >,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_view_backend_input_client() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_view_backend_input_client> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_view_backend_input_client>(),
        64usize,
        concat!("Size of: ", stringify!(wpe_view_backend_input_client))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_view_backend_input_client>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_view_backend_input_client))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle_keyboard_event) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(handle_keyboard_event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle_pointer_event) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(handle_pointer_event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle_axis_event) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(handle_axis_event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle_touch_event) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(handle_touch_event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_input_client),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_keyboard_event(
        arg1: *mut wpe_view_backend,
        arg2: *mut wpe_input_keyboard_event,
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_pointer_event(
        arg1: *mut wpe_view_backend,
        arg2: *mut wpe_input_pointer_event,
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_axis_event(
        arg1: *mut wpe_view_backend,
        arg2: *mut wpe_input_axis_event,
    );
}
unsafe extern "C" {
    pub fn wpe_view_backend_dispatch_touch_event(
        arg1: *mut wpe_view_backend,
        arg2: *mut wpe_input_touch_event,
    );
}
/// wpe_view_backend_fullscreen_client:
/// @did_enter_fullscreen: Invoked after fullscreen has been successfully
/// entered. @did_exit_fullscreen: Invoked after fullscreen has been exited.
/// @request_enter_fullscreen: Invoked after user has requested to enter
/// fullscreen. @request_exit_fullscreen: Invoked after user has requested to
/// exit fullscreen.
///
/// A view backend's fullscreen client provides a series of callback functions
/// which are invoked at different stages when a web view becomes fullscreened
/// and back.
///
/// Since: 1.12
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_view_backend_fullscreen_client {
    pub did_enter_fullscreen:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub did_exit_fullscreen:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub request_enter_fullscreen:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub request_exit_fullscreen:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_view_backend_fullscreen_client() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_view_backend_fullscreen_client> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_view_backend_fullscreen_client>(),
        64usize,
        concat!("Size of: ", stringify!(wpe_view_backend_fullscreen_client))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_view_backend_fullscreen_client>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_view_backend_fullscreen_client))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).did_enter_fullscreen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(did_enter_fullscreen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).did_exit_fullscreen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(did_exit_fullscreen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).request_enter_fullscreen) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(request_enter_fullscreen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).request_exit_fullscreen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(request_exit_fullscreen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_view_backend_fullscreen_client),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
unsafe extern "C" {
    /// wpe_view_backend_platform_set_fullscreen:
    /// @view_backend: (transfer none): The view backend which fullscreen state
    /// will be changed. @fullscreen: (transfer none): True if fullscreen.
    ///
    /// Returns: a boolean indicating whether the operation was completed.
    ///
    /// DOM content calls this function to request the platform to enter/exit
    /// fullscreen. The platform will attempt to change it's window
    /// fullscreen state.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_platform_set_fullscreen(
        arg1: *mut wpe_view_backend,
        arg2: bool,
    ) -> bool;
}
unsafe extern "C" {
    /// wpe_view_backend_dispatch_did_enter_fullscreen:
    /// @view_backend: (transfer none): The view backend that triggered the
    /// event.
    ///
    /// Dispatchs the event that indicates fullscreen has been successfully
    /// entered.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_dispatch_did_enter_fullscreen(arg1: *mut wpe_view_backend);
}
unsafe extern "C" {
    /// wpe_view_backend_dispatch_did_exit_fullscreen:
    /// @view_backend: (transfer none): The view backend that triggered the
    /// event.
    ///
    /// Dispatchs the event that indicated fullscreen has been successfully
    /// entered.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_dispatch_did_exit_fullscreen(arg1: *mut wpe_view_backend);
}
unsafe extern "C" {
    /// wpe_view_backend_dispatch_request_enter_fullscreen:
    /// @view_backend: (transfer none): The view backend that triggered the
    /// event.
    ///
    /// Dispatchs the event that indicates user wants to enter DOM fullscreen
    /// state.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_dispatch_request_enter_fullscreen(arg1: *mut wpe_view_backend);
}
unsafe extern "C" {
    /// wpe_view_backend_dispatch_request_exit_fullscreen:
    /// @view_backend: (transfer none): The view backend that triggered the
    /// event.
    ///
    /// Dispatchs the event that indicates user wants to exit DOM fullscreen
    /// state.
    ///
    /// Since: 1.12
    pub fn wpe_view_backend_dispatch_request_exit_fullscreen(arg1: *mut wpe_view_backend);
}
pub type khronos_int32_t = i32;
pub type khronos_uint32_t = u32;
pub type khronos_int64_t = i64;
pub type khronos_uint64_t = u64;
pub type khronos_int8_t = ::std::os::raw::c_schar;
pub type khronos_uint8_t = ::std::os::raw::c_uchar;
pub type khronos_int16_t = ::std::os::raw::c_short;
pub type khronos_uint16_t = ::std::os::raw::c_ushort;
pub type khronos_intptr_t = ::std::os::raw::c_long;
pub type khronos_uintptr_t = ::std::os::raw::c_ulong;
pub type khronos_ssize_t = ::std::os::raw::c_long;
pub type khronos_usize_t = ::std::os::raw::c_ulong;
pub type khronos_float_t = f32;
pub type khronos_utime_nanoseconds_t = khronos_uint64_t;
pub type khronos_stime_nanoseconds_t = khronos_int64_t;
pub const khronos_boolean_enum_t_KHRONOS_FALSE: khronos_boolean_enum_t = 0;
pub const khronos_boolean_enum_t_KHRONOS_TRUE: khronos_boolean_enum_t = 1;
pub const khronos_boolean_enum_t_KHRONOS_BOOLEAN_ENUM_FORCE_SIZE: khronos_boolean_enum_t =
    2147483647;
pub type khronos_boolean_enum_t = ::std::os::raw::c_uint;
pub type EGLNativeDisplayType = *mut ::std::os::raw::c_void;
pub type EGLNativePixmapType = khronos_uintptr_t;
pub type EGLNativeWindowType = khronos_uintptr_t;
pub type NativeDisplayType = EGLNativeDisplayType;
pub type NativePixmapType = EGLNativePixmapType;
pub type NativeWindowType = EGLNativeWindowType;
pub type EGLint = khronos_int32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_target {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_offscreen_target {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_interface {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub get_native_display: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> EGLNativeDisplayType,
    >,
    pub get_platform:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> u32>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_interface>(),
        56usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_native_display) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(get_native_display)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_platform) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(get_platform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_base {
    pub interface: *const wpe_renderer_backend_egl_interface,
    pub interface_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_base() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_base> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_base>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_base))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_base>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_base),
            "::",
            stringify!(interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_base),
            "::",
            stringify!(interface_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_target_interface {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut wpe_renderer_backend_egl_target,
            arg2: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub initialize: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_void,
            arg3: u32,
            arg4: u32,
        ),
    >,
    pub get_native_window: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> EGLNativeWindowType,
    >,
    pub resize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u32, arg3: u32),
    >,
    pub frame_will_render:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub frame_rendered:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub deinitialize:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_target_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_target_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_target_interface>(),
        88usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_target_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_target_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_target_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_native_window) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(get_native_window)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(resize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_will_render) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(frame_will_render)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rendered) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(frame_rendered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinitialize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(deinitialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_target_base {
    pub interface: *const wpe_renderer_backend_egl_target_interface,
    pub interface_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_target_base() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_target_base> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_target_base>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_target_base))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_target_base>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_target_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_base),
            "::",
            stringify!(interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_base),
            "::",
            stringify!(interface_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_offscreen_target_interface {
    pub create: ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub initialize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut ::std::os::raw::c_void),
    >,
    pub get_native_window: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> EGLNativeWindowType,
    >,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_offscreen_target_interface() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_offscreen_target_interface> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_offscreen_target_interface>(),
        64usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_offscreen_target_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_offscreen_target_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_offscreen_target_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_native_window) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(get_native_window)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_interface),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_offscreen_target_base {
    pub interface: *const wpe_renderer_backend_egl_offscreen_target_interface,
    pub interface_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_offscreen_target_base() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_offscreen_target_base> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_offscreen_target_base>(),
        16usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_offscreen_target_base))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_offscreen_target_base>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_offscreen_target_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_base),
            "::",
            stringify!(interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_offscreen_target_base),
            "::",
            stringify!(interface_data)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_create(
        arg1: ::std::os::raw::c_int,
    ) -> *mut wpe_renderer_backend_egl;
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_destroy(arg1: *mut wpe_renderer_backend_egl);
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_get_native_display(
        arg1: *mut wpe_renderer_backend_egl,
    ) -> EGLNativeDisplayType;
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_get_platform(arg1: *mut wpe_renderer_backend_egl) -> u32;
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_create(
        arg1: ::std::os::raw::c_int,
    ) -> *mut wpe_renderer_backend_egl_target;
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_destroy(arg1: *mut wpe_renderer_backend_egl_target);
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_set_client(
        arg1: *mut wpe_renderer_backend_egl_target,
        arg2: *const wpe_renderer_backend_egl_target_client,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_initialize(
        arg1: *mut wpe_renderer_backend_egl_target,
        arg2: *mut wpe_renderer_backend_egl,
        arg3: u32,
        arg4: u32,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_get_native_window(
        arg1: *mut wpe_renderer_backend_egl_target,
    ) -> EGLNativeWindowType;
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_resize(
        arg1: *mut wpe_renderer_backend_egl_target,
        arg2: u32,
        arg3: u32,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_frame_will_render(
        arg1: *mut wpe_renderer_backend_egl_target,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_frame_rendered(
        arg1: *mut wpe_renderer_backend_egl_target,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_deinitialize(arg1: *mut wpe_renderer_backend_egl_target);
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_offscreen_target_create()
    -> *mut wpe_renderer_backend_egl_offscreen_target;
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_offscreen_target_destroy(
        arg1: *mut wpe_renderer_backend_egl_offscreen_target,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_offscreen_target_initialize(
        arg1: *mut wpe_renderer_backend_egl_offscreen_target,
        arg2: *mut wpe_renderer_backend_egl,
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_offscreen_target_get_native_window(
        arg1: *mut wpe_renderer_backend_egl_offscreen_target,
    ) -> EGLNativeWindowType;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpe_renderer_backend_egl_target_client {
    pub frame_complete:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub _wpe_reserved0: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _wpe_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_wpe_renderer_backend_egl_target_client() {
    const UNINIT: ::std::mem::MaybeUninit<wpe_renderer_backend_egl_target_client> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpe_renderer_backend_egl_target_client>(),
        40usize,
        concat!("Size of: ", stringify!(wpe_renderer_backend_egl_target_client))
    );
    assert_eq!(
        ::std::mem::align_of::<wpe_renderer_backend_egl_target_client>(),
        8usize,
        concat!("Alignment of ", stringify!(wpe_renderer_backend_egl_target_client))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_complete) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_client),
            "::",
            stringify!(frame_complete)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_client),
            "::",
            stringify!(_wpe_reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_client),
            "::",
            stringify!(_wpe_reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_client),
            "::",
            stringify!(_wpe_reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wpe_reserved3) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wpe_renderer_backend_egl_target_client),
            "::",
            stringify!(_wpe_reserved3)
        )
    );
}
unsafe extern "C" {
    pub fn wpe_renderer_backend_egl_target_dispatch_frame_complete(
        arg1: *mut wpe_renderer_backend_egl_target,
    );
}
